2023/redis-benchmark/3_cores_bench.txt
====== PING_INLINE ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

0.00% <= 0.1 milliseconds
0.27% <= 0.2 milliseconds
0.97% <= 0.3 milliseconds
3.14% <= 0.4 milliseconds
14.34% <= 0.5 milliseconds
84.32% <= 0.6 milliseconds
94.47% <= 0.7 milliseconds
96.99% <= 0.8 milliseconds
97.72% <= 0.9 milliseconds
98.18% <= 1.0 milliseconds
99.16% <= 1.1 milliseconds
99.79% <= 1.2 milliseconds
99.86% <= 1.3 milliseconds
99.89% <= 1.4 milliseconds
99.95% <= 1.5 milliseconds
99.96% <= 1.6 milliseconds
99.97% <= 1.7 milliseconds
99.98% <= 1.9 milliseconds
99.98% <= 2 milliseconds
99.99% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 14 milliseconds
79872.20 requests per second

====== PING_BULK ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.15% <= 1 milliseconds
100.00% <= 2 milliseconds
100.00% <= 2 milliseconds
80000.00 requests per second

====== SET ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.14% <= 1 milliseconds
100.00% <= 2 milliseconds
79936.05 requests per second

====== GET ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.36% <= 1 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
80000.00 requests per second

====== INCR ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.32% <= 1 milliseconds
99.96% <= 2 milliseconds
99.98% <= 12 milliseconds
100.00% <= 12 milliseconds
80000.00 requests per second

====== LPUSH ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.13% <= 1 milliseconds
99.80% <= 2 milliseconds
99.84% <= 3 milliseconds
99.87% <= 4 milliseconds
99.88% <= 6 milliseconds
99.89% <= 7 milliseconds
99.94% <= 9 milliseconds
99.94% <= 10 milliseconds
99.95% <= 14 milliseconds
99.97% <= 15 milliseconds
99.99% <= 17 milliseconds
99.99% <= 18 milliseconds
100.00% <= 18 milliseconds
80000.00 requests per second

====== RPUSH ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.13% <= 1 milliseconds
99.93% <= 2 milliseconds
99.96% <= 3 milliseconds
99.97% <= 4 milliseconds
99.98% <= 13 milliseconds
100.00% <= 13 milliseconds
79936.05 requests per second

====== LPOP ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.13% <= 1 milliseconds
100.00% <= 1 milliseconds
80000.00 requests per second

====== RPOP ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.26% <= 1 milliseconds
99.97% <= 6 milliseconds
99.98% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 10 milliseconds
80000.00 requests per second

====== SADD ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.33% <= 1 milliseconds
99.97% <= 2 milliseconds
99.98% <= 3 milliseconds
99.99% <= 12 milliseconds
100.00% <= 12 milliseconds
79936.05 requests per second

====== HSET ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.03% <= 1 milliseconds
99.98% <= 2 milliseconds
99.98% <= 4 milliseconds
100.00% <= 4 milliseconds
80000.00 requests per second

====== SPOP ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.15% <= 1 milliseconds
99.96% <= 2 milliseconds
99.98% <= 3 milliseconds
99.98% <= 12 milliseconds
100.00% <= 13 milliseconds
79936.05 requests per second

====== ZADD ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.17% <= 1 milliseconds
99.95% <= 2 milliseconds
99.95% <= 4 milliseconds
99.97% <= 7 milliseconds
99.99% <= 12 milliseconds
100.00% <= 12 milliseconds
79936.05 requests per second

====== ZPOPMIN ======
  100000 requests completed in 1.12 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.21% <= 1 milliseconds
99.98% <= 2 milliseconds
100.00% <= 2 milliseconds
89126.56 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 1.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

98.11% <= 1 milliseconds
99.92% <= 2 milliseconds
99.95% <= 4 milliseconds
99.96% <= 5 milliseconds
99.98% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 9 milliseconds
85836.91 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 1.75 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

94.47% <= 1 milliseconds
99.98% <= 2 milliseconds
99.99% <= 13 milliseconds
100.00% <= 13 milliseconds
57110.22 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 3.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

10.53% <= 1 milliseconds
99.44% <= 2 milliseconds
99.91% <= 3 milliseconds
99.98% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
30750.31 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 4.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

2.19% <= 1 milliseconds
81.43% <= 2 milliseconds
99.64% <= 3 milliseconds
99.88% <= 4 milliseconds
99.92% <= 5 milliseconds
99.94% <= 6 milliseconds
99.95% <= 7 milliseconds
99.97% <= 8 milliseconds
99.98% <= 9 milliseconds
99.99% <= 10 milliseconds
99.99% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 14 milliseconds
23529.41 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 5.50 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

0.71% <= 1 milliseconds
38.77% <= 2 milliseconds
96.46% <= 3 milliseconds
99.84% <= 4 milliseconds
99.96% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
18171.91 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 1.50 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 3

96.83% <= 1 milliseconds
99.95% <= 2 milliseconds
99.97% <= 3 milliseconds
99.99% <= 12 milliseconds
100.00% <= 12 milliseconds
66622.25 requests per second